dietolive-tw/ESP32-S3-CAM-MJPEG2SD/src/motionDetect.cpp
#if INCLUDE_TINYML

static int getImageData(size_t offset, size_t length, float *out_ptr) {
  // copy to features as grayscale or RGB
  // Source buffer is g_mlInputBuff (set by tinyMLclassify) so that the
  // classifier can read from a separate 64x64 buffer without disturbing
  // the 96x96 currBuff used by motion detection.
  uint8_t* src = g_mlInputBuff ? g_mlInputBuff : currBuff;
  size_t pixelPtr = offset * colorDepth;
  size_t out_ptr_idx = 0;
  while (out_ptr_idx < length) {
    out_ptr[out_ptr_idx++] = (colorDepth == RGB888_BYTES)  
      ? (float)((src[pixelPtr] << 16) + (src[pixelPtr + 1] << 8) + src[pixelPtr + 2])
      : (float)((src[pixelPtr] << 16) + (src[pixelPtr] << 8) + src[pixelPtr]);  
    pixelPtr += colorDepth;
  } 
  return 0;
}

// Run ML classifier on current 96x96 image in currBuff.
// - Classification model: returns true if top class probability > mlProbability
//   (used as motion filter; does not modify centroid)
// - FOMO object detection model: returns true if a target class is detected
//   with probability > mlProbability. As a side effect, updates
//   motionCentroidX/Y with the highest-confidence target centroid so that
//   trackMotionObject() can drive the pan/tilt steppers to follow the object.
//   If no target is detected, sets motionCentroidX/Y = -1.0 so that
//   trackMotionObject() stops moving.
// mlTrackClass: target class name (case-insensitive). Empty = any class.
static bool tinyMLclassify(size_t RESIZE_DIM) {
  bool out = false;
  uint32_t dTime = millis(); 
  // reduce size of bitmap to that required by classifier and copy to features as grayscale or RGB
  // IMPORTANT: use a separate buffer for classifier input. Reusing currBuff would
  // overwrite the 96x96 motion-detection bitmap with the 64x64 scaled-down image
  // and break subsequent frame-to-frame comparison in checkMotion().
  signal_t features_signal;
  if ((int)RESIZE_DIM != EI_CLASSIFIER_INPUT_WIDTH) {
    size_t tempSize = EI_CLASSIFIER_INPUT_WIDTH * EI_CLASSIFIER_INPUT_HEIGHT * colorDepth;
    static uint8_t* mlBuff = NULL;
    if (mlBuff == NULL) mlBuff = (uint8_t*)ps_malloc(EI_CLASSIFIER_INPUT_WIDTH * EI_CLASSIFIER_INPUT_HEIGHT * RGB888_BYTES);
    if (mlBuff == NULL) {
      LOG_WRN("tinyML: alloc %u bytes failed", tempSize);
      return false;
    }
    rescaleImage(currBuff, RESIZE_DIM, RESIZE_DIM, mlBuff, EI_CLASSIFIER_INPUT_WIDTH, EI_CLASSIFIER_INPUT_HEIGHT);
    // features_signal.get_data reads from this buffer via getImageData()
    g_mlInputBuff = mlBuff;
  } else {
    g_mlInputBuff = currBuff;
  }
  features_signal.total_length = EI_CLASSIFIER_INPUT_WIDTH * EI_CLASSIFIER_INPUT_HEIGHT;
  features_signal.get_data = &getImageData;

  // Run the classifier
  ei_impulse_result_t result = { 0 };
  EI_IMPULSE_ERROR res = run_classifier(&features_signal, &result, false);
  if (res != EI_IMPULSE_OK) {
    LOG_WRN("Failed to run classifier (%d)", res);
    return false;
  }

#if EI_CLASSIFIER_OBJECT_DETECTION
  // ---- FOMO object detection: locate target object(s) in frame ----
  float bestProb = 0.0f;
  float bestCx = -1.0f, bestCy = -1.0f;
  bool targetFound = false;
  char summary[256] = {0};
  size_t slen = 0;

  for (uint16_t i = 0; i < result.bounding_boxes_count; i++) {
    ei_impulse_result_bounding_box_t* bb = &result.bounding_boxes[i];
    if (bb->value <= 0.0f) continue;
    // Filter by target class if user specified one (case-insensitive match)
    if (mlTrackClass[0] != 0) {
      if (bb->label == NULL || strcasecmp(bb->label, mlTrackClass) != 0) continue;
    }
    if (dbgVerbose && slen < sizeof(summary) - 32) {
      slen += snprintf(summary + slen, sizeof(summary) - slen - 1,
                       "%s: %.2f@(%u,%u %ux%u), ",
                       bb->label ? bb->label : "?", bb->value, bb->x, bb->y, bb->width, bb->height);
    }
    if (bb->value >= mlProbability && bb->value > bestProb) {
      bestProb = bb->value;
      // FOMO outputs grid cells whose center is the object centroid.
      // Centroid in normalized coords 0.0~1.0
      float cx = (bb->x + bb->width / 2.0f) / (float)EI_CLASSIFIER_INPUT_WIDTH;
      float cy = (bb->y + bb->height / 2.0f) / (float)EI_CLASSIFIER_INPUT_HEIGHT;
      bestCx = constrain(cx, 0.0f, 1.0f);
      bestCy = constrain(cy, 0.0f, 1.0f);
      targetFound = true;
    }
  }

  if (targetFound) {
    out = true;
    motionCentroidX = bestCx;
    motionCentroidY = bestCy;
  } else {
    // No target detected: invalidate centroid so tracking stops
    motionCentroidX = -1.0;
    motionCentroidY = -1.0;
  }
  LOG_INF("FOMO: %s in %ums (best %.2f @ %.2f,%.2f) -> %s",
          summary, millis() - dTime, bestProb, bestCx, bestCy,
          targetFound ? "TRACK" : "none");
#else
  // ---- Image classification (existing path): filter only ----
  if (result.classification[0].value > mlProbability) {
    out = true; // sufficient classification match, so keep motion detection
    if (dbgVerbose) {
      LOG_VRB("Prob: %0.2f, Timing: DSP %d ms, inference %d ms, anomaly %d ms", 
      result.classification[0].value, result.timing.dsp, result.timing.classification, result.timing.anomaly);
      char outcome[200] = {0};
      for (uint16_t i = 0; i < EI_CLASSIFIER_LABEL_COUNT; i++)
        sprintf(outcome + strlen(outcome), "%s: %.2f, ", ei_classifier_inferencing_categories[i], result.classification[i].value);
      LOG_VRB("Predictions - %s in %ums", outcome, millis() - dTime);
    } 
  } 
#endif // EI_CLASSIFIER_OBJECT_DETECTION

  return out;
}
#endif // INCLUDE_TINYML

bool checkMotion(camera_fb_t* fb, bool motionStatus, bool lightLevelOnly) {
  // check difference between current and previous image (subtract background)
  // convert image from JPEG to downscaled RGB888 or 8 bit grayscale bitmap
  size_t RESIZE_DIM = 96;  // dimensions of resized motion bitmap
  static bool firstCall = true;
  if (firstCall) {
    if (ESP.getPsramSize() < 3 * ONEMEG) RESIZE_DIM = 64; // otherwise insufficient PSRAM (issue #706)
    firstCall = false;
  }
  size_t RESIZE_DIM_SQ = (RESIZE_DIM * RESIZE_DIM); // pixels in bitmap
  
  if (fsizePtr > FRAMESIZE_SXGA) return false;
  uint32_t dTime = millis();
  uint32_t lux = 0;
  static uint32_t motionCnt = 0;
  static uint8_t fsizePtrPrev = 255; // initially invalid to force setup on first call
  static uint8_t scaling, downsize;
  static uint16_t reducer;
  static int sampleWidth = 0, sampleHeight = 0;
  static uint8_t* rgbBuf = (uint8_t*)heap_caps_aligned_calloc(16, 1, frameData[FRAMESIZE_SXGA].frameWidth * frameData[FRAMESIZE_SXGA].frameHeight * RGB888_BYTES / 8, MALLOC_CAP_SPIRAM); // must be 16 byte aligned. Max size, no need to free
 #if INCLUDE_NEW_JPG
  static struct esp_jpeg_stream jpegHandle = {0};
  static uint8_t* jpgBuf = (uint8_t*)ps_malloc(RESIZE_DIM_SQ * RGB888_BYTES);
#endif  

  // calculate parameters for sample size when resolution changes
  if (fsizePtr != fsizePtrPrev) {
    fsizePtrPrev = fsizePtr;
    scaling = frameData[fsizePtr].scaleFactor; 
    reducer = frameData[fsizePtr].sampleRate;
    downsize = pow(2, scaling) * reducer;
    stride = (colorDepth == RGB888_BYTES) ? GRAYSCALE_BYTES : RGB888_BYTES; // stride is inverse of colorDepth
    sampleWidth = frameData[fsizePtr].frameWidth / downsize;
    sampleHeight = frameData[fsizePtr].frameHeight / downsize;
#if INCLUDE_NEW_JPG
    jpg2rgbClose(&jpegHandle);
    jpgReduce(fb->width, fb->height, downsize, &sampleWidth, &sampleHeight);
    if (!jpg2rgbOpen(&jpegHandle, sampleWidth, sampleHeight)) return motionStatus;
#endif
  }
#if INCLUDE_NEW_JPG
  if (!jpg2rgb(&jpegHandle, fb->buf, fb->len, rgbBuf)) return motionStatus;
#else
  if (!jpg2rgb((uint8_t*)fb->buf, fb->len, rgbBuf, scaling)) return motionStatus;
#endif

#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 0)
  if (colorDepth == GRAYSCALE_BYTES) rgbToGray(rgbBuf, sampleWidth, sampleHeight);
#endif
  LOG_VRB("JPEG to rescaled %s bitmap conversion %u bytes in %lums", colorDepth == RGB888_BYTES ? "color" : "grayscale", sampleWidth * sampleHeight * colorDepth, millis() - dTime);
  
