dietolive-tw/ESP32-S3-CAM-MJPEG2SD/src/motionDetect.cpp
  // allocate buffer space on heap
  size_t resizeDimLen = RESIZE_DIM_SQ * colorDepth; // byte size of bitmap
  if (motionJpeg == NULL) motionJpeg = (uint8_t*)ps_malloc(32 * 1024);
  if (currBuff == NULL) currBuff = (uint8_t*)ps_malloc(RESIZE_DIM_SQ * RGB888_BYTES);
  static uint8_t* prevBuff = (uint8_t*)ps_malloc(RESIZE_DIM_SQ * RGB888_BYTES);
  static uint8_t* changeMap = (uint8_t*)ps_malloc(RESIZE_DIM_SQ * RGB888_BYTES);
  
  dTime = millis();
  rescaleImage(rgbBuf, sampleWidth, sampleHeight, currBuff, RESIZE_DIM, RESIZE_DIM);
  LOG_VRB("Bitmap rescale to %u bytes in %lums", resizeDimLen, millis() - dTime);
  // compare each pixel in current frame with previous frame 
  dTime = millis();
  int changeCount = 0;
  // set horizontal region of interest in image 
  uint16_t startPixel = (RESIZE_DIM*(detectStartBand-1)/detectNumBands) * RESIZE_DIM * colorDepth;
  uint16_t endPixel = (RESIZE_DIM*(detectEndBand)/detectNumBands) * RESIZE_DIM * colorDepth;
  int moveThreshold = max(1, (int)(((endPixel - startPixel) / colorDepth) * (11 - motionVal) / 100)); // number of changed pixels that constitute a movement
  // accumulate centroid of changed pixels for object tracking
  int32_t sumX = 0, sumY = 0, centroidCount = 0;
  for (size_t i = 0; i < resizeDimLen; i += colorDepth) {
    uint16_t currPix = 0, prevPix = 0;
    for (int j = 0; j < colorDepth; j++) {
      currPix += currBuff[i + j];
      prevPix += prevBuff[i + j];
    }
    currPix /= colorDepth;
    prevPix /= colorDepth;
    lux += currPix; // for calculating light level
    uint8_t pixVal = 255; // show active changed pixel as bright red color in changeMap image
    // set up display image for motion tracking debug
    if (dbgMotion) for (int j = 0; j < RGB888_BYTES; j++) changeMap[(i * stride) + j] = currPix; // grayscale
    // determine pixel change status
    if (abs((int)currPix - (int)prevPix) > detectChangeThreshold) {
      if (i > startPixel && i < endPixel) {
        changeCount++; // number of changed pixels
        // accumulate centroid position (only in active bands)
        size_t pixIdx = i / colorDepth;
        sumX += (int32_t)(pixIdx % RESIZE_DIM);
        sumY += (int32_t)(pixIdx / RESIZE_DIM);
        centroidCount++;
      }
      else pixVal = 80; // show inactive changed pixel as dark red color in changeMap image
      if (dbgMotion) {
        changeMap[(i * stride) + 2] = pixVal;
        for (int j = 0; j < RGB888_BYTES - 1; j++) changeMap[(i * stride) + j] = 0;
      }
    }
  }

  // calculate motion centroid as 0.0~1.0 (center of image = 0.5), or -1.0 if no motion
  // only set valid centroid when changeCount exceeds moveThreshold to avoid
  // tracking noise; otherwise invalidate so trackMotionObject() holds position
  if (changeCount > moveThreshold && centroidCount > 0) {
    motionCentroidX = (float)sumX / centroidCount / (float)(RESIZE_DIM - 1);
    motionCentroidY = (float)sumY / centroidCount / (float)(RESIZE_DIM - 1);
  } else {
    motionCentroidX = -1.0;
    motionCentroidY = -1.0;
  }

  lightLevel = (lux*100)/(RESIZE_DIM_SQ*255); // light value as a %
  nightTime = isNight(nightSwitch);
  memcpy(prevBuff, currBuff, resizeDimLen); // save image for next comparison 
  LOG_VRB("Detected %u changes, threshold %u, light level %u, in %lums", changeCount, moveThreshold, lightLevel, millis() - dTime);
  if (lightLevelOnly) return false; // no motion checking, only calc of light level

#if INCLUDE_TINYML
  // FOMO tracking mode: when ML and auto-tracking are both enabled, run the
  // classifier on every motion check (throttled by doMonitor to ~5 fps during
  // monitoring, slower during recording). The classifier updates
  // motionCentroidX/Y from the detected target bounding box, overriding the
  // background-subtraction centroid so trackMotionObject() follows the object
  // rather than generic motion. mlTargetFound drives the motion state.
  bool mlTrackingMode = mlUse && trackMotion;
  bool mlTargetFound = false;
  if (mlTrackingMode) mlTargetFound = tinyMLclassify(RESIZE_DIM);
#endif

  if (dbgMotion) {
    // show motion detection during streaming for tuning
    if (!motionJpegLen) {
      // ready to setup next movement map for streaming
      dTime = millis();
      // build jpeg of changeMap for debug streaming
#if INCLUDE_NEW_JPG
      motionJpegLen = rgb2jpg(changeMap, RESIZE_DIM, RESIZE_DIM, JPEG_QUAL, jpgBuf);
      if (motionJpegLen == 0) LOG_WRN("motionDetect: encode() failed"); 
      else memcpy(motionJpeg, jpgBuf, motionJpegLen); 
#else
      uint8_t* jpg_buf = NULL;
      if (!fmt2jpg(changeMap, resizeDimLen, RESIZE_DIM, RESIZE_DIM, PIXFORMAT_RGB888, JPEG_QUAL, &jpg_buf, &motionJpegLen))
        LOG_WRN("motionDetect: fmt2jpg() failed"); 
      else memcpy(motionJpeg, jpg_buf, motionJpegLen); 
      free(jpg_buf);
      jpg_buf = NULL;
#endif
      if (motionJpegLen) xSemaphoreGive(motionSemaphore);
      LOG_VRB("Created changeMap JPEG %d bytes in %lums", motionJpegLen, millis() - dTime);
    }
  } else {
    // normal motion detection
    dTime = millis();
#if INCLUDE_TINYML
    if (mlTrackingMode && !pirGate) {
      // FOMO tracking: motion is driven by ML detection of target class.
      // When pirGate is enabled, visual motion detection is used instead
      // (PIR wakes camera, background subtraction confirms visual change).
      // FOMO still runs above for centroid/tracking, but doesn't gate recording.
      if (mlTargetFound) {
        if (motionCnt == 0) LOG_INF("FOMO detect: target=%s", mlTrackClass[0] ? mlTrackClass : "any");
        motionCnt++; // number of consecutive target detections
        if (!motionStatus && motionCnt >= detectMotionFrames) {
          LOG_INF("***** Motion - START (FOMO target=%s)", mlTrackClass[0] ? mlTrackClass : "any");
          motionStatus = true; // motion started
          dTime = millis();
#if INCLUDE_MQTT
          if (mqtt_active && motionCnt) {
            sprintf(jsonBuff, "{\"MOTION\":\"ON\",\"TIME\":\"%s\"}", esp_log_system_timestamp());
            mqttPublish(jsonBuff);
            mqttPublishPath("motion", "on");
#if INCLUDE_HASIO
            mqttPublishPath("cmd", "still");
#endif
          }
#endif
        }
      } else {
        if (motionStatus) LOG_INF("FOMO: target lost, motionCnt=%lu", motionCnt);
        motionCnt = 0;
      }
    } else
#endif
    {
      // background subtraction motion detection
      if (!nightTime && changeCount > moveThreshold) {
        LOG_VRB("### Change detected");
        motionCnt++; // number of consecutive changes
        // need minimum sequence of changes to signal valid movement
        if (!motionStatus && motionCnt >= detectMotionFrames) {
          LOG_VRB("***** Motion - START");
          motionStatus = true; // motion started
#if INCLUDE_TINYML
          // pass image to TinyML for classification (filter only, no tracking)
          if (mlUse) {
            bool fomoOk = tinyMLclassify(RESIZE_DIM);
            LOG_INF("FOMO detect: %s (filter mode)", fomoOk ? "confirmed" : "rejected");
            if (!fomoOk) {
              motionCnt = 0; // not classified, so cancel motion
              motionStatus = false;
            }
          }
#endif
          dTime = millis();
#if INCLUDE_MQTT
          if (mqtt_active && motionCnt) {
            sprintf(jsonBuff, "{\"MOTION\":\"ON\",\"TIME\":\"%s\"}", esp_log_system_timestamp());
            mqttPublish(jsonBuff);
            mqttPublishPath("motion", "on");
#if INCLUDE_HASIO
            mqttPublishPath("cmd", "still");
#endif
          }
#endif
        } 
      } else motionCnt = 0;
    }
  
    if (motionStatus && !motionCnt) {
      // insufficient change or motion not classified
      LOG_VRB("***** Motion - STOP");
      motionStatus = false; // motion stopped
#if INCLUDE_MQTT
      if (mqtt_active) {
        sprintf(jsonBuff, "{\"MOTION\":\"OFF\",\"TIME\":\"%s\"}", esp_log_system_timestamp());
        mqttPublish(jsonBuff);
        mqttPublishPath("motion", "off");
      }
#endif
    } 
    if (motionStatus) LOG_VRB("*** Motion - ongoing %lu frames", motionCnt);
  }
  
